# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, efficientnet_v2, []]  # 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 5 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] #6
  - [-1, 1, Conv, [256, 1, 1]] # 7, Y5, lateral_convs.0

  - [-1, 1, Conv, [256, 1, 1]] # 8
  - [3, 1, Conv, [256, 3, 2]] # 9, downsample_convs.0
  - [[-1, 8], 1, Concat, [1]] # 10
  - [-1, 3, CSPStage, [512]] # F4 (11), pan_blocks.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #12
  - [2, 1, Conv, [256, 3, 2]] # 13 input_proj.1
  - [[12, -1, 3], 1, Concat, [1]] #14
  - [-1, 3, RepC3, [256]] # 15, fpn_blocks.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #16
  - [[-1, 2], 1, Concat, [1]] # cat backbone P4 17
  - [-1, 3, RepC3, [256]] # X3 (18), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]] # 19, downsample_convs.0
  - [[-1, 15], 1, Concat, [1]] # cat Y4 20
  - [-1, 3, CSPStage, [512]] # F4 (21), pan_blocks.0

  - [15, 1, Conv, [256, 3, 2]] # 22, downsample_convs.1
  - [21, 1, Conv, [256, 3, 2]] # 23, downsample_convs.1
  - [[11, 22, -1], 1, Concat, [1]] # cat Y5 24
  - [-1, 3, CSPStage, [1024]] # F5 (25), pan_blocks.1

  - [[18, 21, 25], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)




